<?php
/**
 * Created by PhpStorm.
 * User: usama_000
 * Date: 10/9/14
 * Time: 8:33 PM
 */

return (

    [
        'restricted_area' => 'حدث خطأ ما يرجى محاولة الدخول لاحقا ..',
        'warning_msg'     => 'يرجى إدخال البيانات بطريقة صحيحة',
        'comment_success' => 'تم تسجيل التعليق بنجاح',
        'error_msg'       => 'حدوث خطأ بالنظام',
        'contactus_success' => 'تم إرسال رسالتكم بنجاح سيتم التواصل معكم لاحقا .. شكر',
        'reset_success'     => 'تم تعديل كلمة المرور بنجاح',
        'reset_error'       => 'لم يتم تغير كلمة المرور .. يرجى المحاولة مرة أخرى',
        'signin_success'    => 'تمت عمليه الدخول بنجاح .. شكرا',
        'signin_error'      => 'تم إدخال كلمة المرور بطريقة خاطئة يرجى التأكد من البيانات المدخلة .. شكرا'

    ]
);