<?php
/**
 * Created by PhpStorm.
 * User: usama_000
 * Date: 10/9/14
 * Time: 8:33 PM
 */

return (

    [
        'restricted_area'           => 'حدث خطأ ما يرجى محاولة الدخول لاحقا ..',
        'warning_msg'               => 'يرجى إدخال البيانات بطريقة صحيحة',
        'comment_success'           => 'تم تسجيل التعليق بنجاح',
        'error_msg'                 => 'حدث خطأ بالنظام ',
        'error_msg_global'          => 'لا يمكن إتمام هذه العملية .. يرجى المحاولة لاحقاً',
        'contactus_success'         => 'تم إرسال رسالتكم بنجاح سيتم التواصل معكم لاحقا .. شكر',
        'reset_success'             => 'تم تعديل كلمة المرور بنجاح',
        'reset_error'               => 'لم يتم تغير كلمة المرور .. يرجى المحاولة مرة أخرى',
        'signin_success'            => 'تمت عمليه الدخول بنجاح .. شكرا',
        'signin_error'              => 'تم إدخال كلمة المرور بطريقة خاطئة يرجى التأكد من البيانات المدخلة .. شكرا',
        'forgotpassword_error'      => 'حد خطأ ما .. أو لم تقم بتسجيل بريدك الإلكتروني معنا سابقاً يرجى المحاولة مرى أخرى',
        'forgotpassword_success'    => 'تم إرسال كلمة المرور للبريد الإلكتروني الخاص بك .. شكرا',
        'signup_success'            => 'تمت عمليه التسجيل بنجاح شكرا للتسجيل .. شكراً',
        'aboutus_success'           => 'تم التعديل بنجاح',
        'aboutus_error'             => 'لم يتم التعديل بنجاح .. برجاء المحاولة مرة اخرى',
        'contactus_success'         => 'تم تعديل المعلومات الخاصة بصفحة اتصل بنا بنجاح .. شكرا',
        'contactus_error'           => 'لم يتم تعديل البيانات بنجاح .. برجاء المحاولة مرة أخرى',
        'upload_error'              => 'لم تتم إضافة مقال جديد .. برجاء المحاولة مرة أخرى',
        'upload_success'            => 'تمت عملية إضافة مقال جديد بنجاح ..'


    ]
);